### Notebook for project1 for programming for Data Analysis

### Add a TOC here...

## Purpose

The purpose of this notebook is to:   

• Choose a real-world phenomenon that can be measured and for which you could collect at least one-hundred data points across at least four different variables.   

• Investigate the types of variables involved, their likely distributions, and their relationships with each other.  
 
• Synthesise/simulate a data set as closely matching their properties as possible.   

• Detail your research and implement the simulation in a Jupyter notebook – the data set itself can simply be displayed in an output cell within the notebook.

## Background

The phenonom I have chosen is new gratuate salaries in Ireland. I chose this subject because...
The expected results of this project will be to simulate a data set of graduate salaries based on a number of contributing factors as detailed below. 

Data released by the CSO (https://www.cso.ie/en/releasesandpublications/ep/p-heo/highereducationoutcomes-graduationyears2010-2019/backgroundstatistics/) shows that in 2019 there were over 42,000 new college graduates in Ireland. 
The numbers of new college graduates in Ireland has been on the increase for a number of years now with Ireland having a higher than the EU average of people with 3rd level education hitting a peak of 61% of 25-34 year olds having a 3rd level education on 2020 (https://www.cso.ie/en/csolatestnews/pressreleases/2021pressreleases/pressstatementeducationalattainmentthematicreport2021/). 
A report by Trinity News in 2022 (https://trinitynews.ie/2022/10/ireland-ranked-third-among-oecd-countries-for-rate-of-third-level-education/) shows that Ireland was ranked 3rd amongst the 38 OECD countries for 3rd level attainment overall. And that 63% of those in the 18-22 year old category were in 3rd level education compared to the EU average of 59%.

Of these, data from HEA (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2021/) shows that over three quarters ended up in employment with (6?) months with approx. 20% going on to furth study.

Of those that were in employment, 91% were working in Ireland with the breakdown of:   
43% working in Dublin (Dublin region)   
15% working in Cork (South West Region)   
7% working in Galway (Mid West Region)   
35% split across the remaining 5 regions (Mid East, South East, West, Border, Midlands).

The data clearly shows that more and more young people are attending and graduating from 3rd level education. An article by Forbes (https://www.forbes.com/advisor/student-loans/why-should-you-go-to-college/) indicates that the primary reason for going to college is to earn more money with college graduates out earning those who finished education at secondary level by as much as almost 50% annually.

This project will focus only on those who graduated with a level 8 Hons degree and fall into the category of new/young graduate. These ranged across a number of NFQ levels from Level 6 through to Level 10. Of these, Level 8 Hons degrees were by far the most popular with over 28,000 (xx%). (https://www.cso.ie/en/releasesandpublications/ep/p-heo/highereducationoutcomes-graduationyears2010-2019/backgroundstatistics/)

According to research by the HEA $^3$ a number of factors can influence a graduate starting salary such as subject/area of study and grade. A study by gradireland $^4$ also suggests that area of study is very important but that location/region also has an impact

To summarise, the four variables we will be researching and simulate a data set for are as follows:

Graduate Salary   
Area of Study   
Award Level   
Location   
Gender (maybe)

### Graduate Salary

There are numerous articles and reports published every year on graduate salaries.
According to research published by the HEA (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/earnings-analysis/) starting graduate salaries in Ireland differ significantly and can range from approx. 30,000 to 45,000 with the average coming in around 37,104. More recent research by the Irish Independent (https://www.independent.ie/irish-news/surge-in-graduate-employment-as-four-in-five-walk-into-a-job-with-average-salary-of-38044/42166132.html) show the average salary for new graduates is now 38,044. An article by The Irish Times (https://www.irishtimes.com/ireland/education/2022/11/23/college-graduates-gain-employment-in-record-numbers/) indicates that the average earnings for all graduates were just over €38,000. 
Graduate salaries have increased steadily over the last 10 years with research published by the CSO (https://www.cso.ie/en/releasesandpublications/ep/p-heo/highereducationoutcomes-graduationyears2010-2019/whatdograduatesearn/) showing a yearly increase generally in line with inflation on average.

Salary is a numeric variable which is defined as quantitative as it represents an amount (in this case the amount is euros). Generally salary is considered a continuous variable particularly if we are considering just whole euro values.

Taking the values from (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/earnings-analysis/) as being the most accurate we come up with the following summary:
Mean – 37104
Median
Standard Deviation
Distribution
Given we only have 3 values, the standard deviation and median values would not mean much but we could assume normal distribution given the information we have.

### Location

For location we are referring to the location of where the graduate is employed post-graduation and not the location of the university they graduated from.

According to the HEA (https://hea.ie/assets/uploads/2021/09/Higher-Education-Institutions-Earnings-Report-September-2021.pdf) a number of factors can influence the starting salary of a graduate and note in particular the relationship between salary and location of employment. A study by gradireland (https://gradireland.com/careers-advice/job-offers-and-working-life/salaries-and-benefits-new-graduates) also claims the importance of location/region as being a factor influencing salary.

The HSE (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/earnings-analysis/) breaks down the country into 8 geographic locations for the purpose of their statistics and suggests that graduates employed in Dublin generally earn the highest average salaries while graduates in the border counties earn the lowest.

Based on the country average being 37,104 I have compiled the following table showing the % difference between each region and the average salary:

| Region | Average Salary | % +/- |
| --- | --- | --- |
| Dublin | 38297 | +3.22% |
| South-West | 37055 | -0.13% |
| Mid-West| 36665 | -1.18% |
| Mid-East | 36475 | -1.7% |
| Midlands | 36413 | -1.86% |
| South-East | 36204 | -2.43% |
| West | 34890 | -5.97% |
| Border | 33018 | -11.01% |


In terms of the number of graduates working in each location, data from the HSE (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/undergraduate-honours-degree-graduates/) shows that by far the total number of graduates end up working in Dublin after leaving college at almost 40%. Next largest is the South-West region with 16% and propping up the table is the Midlands region with 4%

| Country Average | % of total |
| --- | --- |
| Dublin | 40% |
| South-West | 16% |
| West | 10% |
| Mid-West| 10% |
| Mid-East | 8% |
| South-East | 7% |
| Border | 5% |
| Midlands | 4% |

### Grade

The grade a student receives is one of the most important factors influencing their starting salary according to the HEA (https://hea.ie/assets/uploads/2021/09/Higher-Education-Institutions-Earnings-Report-September-2021.pdf).
Statistics from the CSO (https://www.cso.ie/en/releasesandpublications/ep/p-heo/highereducationoutcomes-graduationyears2010-2019/backgroundstatistics/) show the breakdown of grades received. Historically, a H21 grade has been the most popular and the percentage receiving a H2 has been increasing over the last number of years. From 46% 10 years ago to just over 50%. H1s has also seen a percentage increase while H22 and H3s are reducing. 

The following chart breaks down the % of grades received across all graduates for each award level:

Grade | % |
| --- | --- |
| H1 | 16.55 |
| H21 | 50.43 |
| H22| 27.21 |
| H3 | 5.81 |

To see how the grade achieved impacts on a graduates salary we can look at data from gov.ie (https://data.gov.ie/dataset/heo13-graduate-earnings) and statistics released by the HEA (https://hea.ie/statistics/data-for-download-and-visualisations/key-facts-figures/). From these we can see that the average salary is affected by the grade received leaving college as follows:

Grade | % +/- |
| --- | --- |
| H1 | +3% |
| H21 | -9% |
| H22| -15% |
| H3 | -24% |

Grade is a qualitative variable and is considered a categorical variable as it can take only one a small and fixed number of possibilities. And as it is possible to rank them in a meaningful order of H1 to H3 it is an ordinal variable.   
Mean   
Median   
StDev   
Distribution

### Area of Study 

Of all the graduates, almost a quarter (24.53%) had studied a course in the Business/Admin/law sector which was by far the highest number. Next came Health & Welfare with just over 18%, followed by Engineering at just under 11%. At the bottom of the scale came Agriculture with 1.5%. Taken from https://hea.ie/statistics/data-for-download-and-visualisations/key-facts-figures/

| Study Area | % |
| --- | --- |
| Business | 24.53% |
| Health and Welfare| 18.26% |
| Engineering| 10.82% |
| Arts | 10.64% |
| Natural Science | 8.58% |
| Education | 7.85% |
| Social Science | 6.63% |
| ICT | 6.51% |
| Services | 3.84% |
| Agriculture | 1.51% |
| Other | 0.83% |


A study released by the Irish Times (https://www.irishtimes.com/ireland/education/2022/11/23/college-graduates-gain-employment-in-record-numbers/)
highlights the differences across individual areas of study. noting that the highest earners were ICT graduates with an average salary of €45,197, followed by engineering with €42,761 and health and welfare (€38,728).

In contrast, the same report notes arts and humanities graduates earned the least with €29,770, followed by agriculture, forestry, fisheries and veterinary (€32,548) and social sciences, journalism and information (€35,846).

Based on the country average being 37,104 I have compiled the following table with data from (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/earnings-analysis/) showing the % difference between each area of study and the average salary:

| Study Area | % +/- |
| --- | --- |
| Business | -1.8% |
| Health and Welfare| -0.83% |
| Engineering| +10.08% |
| Arts | -24.67% |
| Natural Science | +4.07% |
| Education | +9.46% |
| Social Science | -8.31% |
| ICT | +14.71% |
| Services | -8.88% |
| Agriculture | -13.21% |

To see how Area of Study affects salaries, data from gov.ie $^5$ ...
https://data.gov.ie/dataset/heo13-graduate-earnings

## Gender (if needed)

A report from the CSO (https://www.cso.ie/en/releasesandpublications/ep/p-heo/highereducationoutcomes-graduationyears2010-2019/backgroundstatistics/) shows that females outnumber males 55 – 45%

The HEA report (https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/earnings-analysis/) suggests that the gender pay gap for new graduates in like-for-like circumstances is approx. 1500 in favour of males.

### Add the sample data set I created here

Sample Data set...

Generate simulation based on the above

1. Create dataframe
2. Add first variable (region)
3. Add second variable (grade)
4. Add third variable (course/area of study)
5. calculate salary

In [108]:
# Import modules

import numpy as np
import pandas as pd

# Create dataframe
df = pd.DataFrame()

# Using random.choice to simulate values for location, grade and course
# Create list for Location and add to dataframe
location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
df['location'] = location_list

# Create list for Grade and add to dataframe
grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
df['grade'] = grade_list

# Create list for Course and add to dataframe
#course_list = np.random.choice(['Bus', 'HW', 'Eng','Arts','NatS','Ed', 'SocS', 'ICT','Serv','Agr','Oth'], 100, p=[0.24, 0.18, 0.11, 0.10, 0.09, 0.08, 0.07, 0.06, 0.04, 0.02, 0.01])
course_list = 'ICT'
df['course'] = course_list

rand_sal_ict = [random.randint(40000, 45000) for i in range(100)]
df['salary'] = rand_sal_ict

df_eng = df.copy()
rand_sal_eng = [random.randint(30000, 40000) for i in range(100)]
course_list = 'Eng'
df_eng['course'] = course_list
df_eng['salary'] = rand_sal_eng

df_bus = df.copy()
rand_sal_bus = [random.randint(20000, 30000) for i in range(100)]
course_list = 'Bus'
df_bus['course'] = course_list
df_bus['salary'] = rand_sal_bus

final_df = pd.concat([df, df_eng, df_bus], ignore_index=True)

final_df = final_df.sample(frac = 1)

# newdf = df.copy()
# df3 = df1.append(df2, ignore_index=True)

# Need to find a way to update the df based on course...OR else create 8 individual dfs (per course) and combine later
# Maybe create a table of the courses and salary ranges and loop throught it and then append to the df each time
# Maybe do the same for the salaray updates afterwards - 
# Try this link https://pythonguides.com/python-dictionary-multiple-values/

#df['salary'] = (df['salary'] * h1_rate).where(df['course'] == 'ICT', df['salary'] * 1)
#df['salary'] = rand_sal_ict.where(df['course'] == 'ICT', df['salary'] * 1)
#df['salary'] = [random.randint(20000, 30000) for i in range(100)].where(df['course'] == 'ICT', df['salary'] * 1)

final_df

# Now need to work out how to calculate salary based on course, grade and location!!!
# # If course = 'ICT' and grade = 'H1' and location = 'Galway' then...
# Or maybe, add random salary, then update up/down based on course/location/grade
# Or maybe, add average salary, then update up/down based on course/location/grade
# Maybe...add random distributed salaries by course, then adjust up/down based on grade and then location

# OR maybe create individual dfs per course or per something else... 

# Could be lazy and just create a random salary based on the the high and low values we have!!!

# Check this link
# https://www.dataquest.io/blog/tutorial-add-column-pandas-dataframe-based-on-if-else-condition/

     location grade course  salary
255    Dublin   H21    Bus   22948
45   Mid-West   H21    ICT   40210
159    Dublin   H21    Eng   38865
283    Dublin   H21    Bus   20065
205    Dublin   H22    Bus   24009
..        ...   ...    ...     ...
29       West    H3    ICT   44105
158  Mid-East   H22    Eng   30820
151  Midlands   H21    Eng   34655
20     Dublin    H3    ICT   43521
160      West   H21    Eng   39587

[300 rows x 4 columns]

In [109]:
x = 'A', 40000, 50000
x

('A', 40000, 50000)

In [110]:
# To get 100 random salaries between the max and min...assuming a standard normal distribution of values

import random

rand_sal = [random.randint(27951, 42562) for i in range(100)]

# To just show the first 10 numbers in the list

#x[:10]
df['salary'] = rand_sal

df

      location grade course  salary
0       Dublin    H1    ICT   28803
1       Dublin   H21    ICT   40574
2     Mid-East    H1    ICT   34320
3       Dublin   H21    ICT   40504
4     Mid-West   H21    ICT   33282
..         ...   ...    ...     ...
95      Dublin   H22    ICT   31499
96  South-West   H21    ICT   28226
97        West   H21    ICT   33892
98      Dublin    H1    ICT   36548
99        West    H1    ICT   29429

[100 rows x 4 columns]

In [111]:
# Apply Grade Rates
h1_rate = 1.03
h21_rate = 0.91
h22_rate = 0.85
h3_rate = 0.76

df['salary'] = (df['salary'] * h1_rate).where(df['grade'] == 'H1', df['salary'] * 1)
df['salary'] = (df['salary'] * h21_rate).where(df['grade'] == 'H21', df['salary'] * 1)
df['salary'] = (df['salary'] * h22_rate).where(df['grade'] == 'H22', df['salary'] * 1)
df['salary'] = (df['salary'] * h3_rate).where(df['grade'] == 'H3', df['salary'] * 1)


# Apply Location rates
dublin_rate = 1.0322
sw_rate = 0.9987
mw_rate = 0.9882
me_rate = 0.983
m_rate = 0.9814
se_rate = 0.9957
w_rate = 0.9421
b_rate = 0.8899

df['salary'] = (df['salary'] * dublin_rate).where(df['location'] == 'Dublin', df['salary'] * 1)
df['salary'] = (df['salary'] * sw_rate).where(df['location'] == 'South-West', df['salary'] * 1)
df['salary'] = (df['salary'] * mw_rate).where(df['location'] == 'Mid-West', df['salary'] * 1)
df['salary'] = (df['salary'] * me_rate).where(df['location'] == 'Mid-East', df['salary'] * 1)
df['salary'] = (df['salary'] * m_rate).where(df['location'] == 'Midlands', df['salary'] * 1)
df['salary'] = (df['salary'] * se_rate).where(df['location'] == 'South-East', df['salary'] * 1)
df['salary'] = (df['salary'] * w_rate).where(df['location'] == 'West', df['salary'] * 1)
df['salary'] = (df['salary'] * b_rate).where(df['location'] == 'Border', df['salary'] * 1)


# Apply area_of_study rates
bus_rate = 1.0322
hw_rate = 0.9917
eng_rate = 1.1008
arts_rate = 0.7533
ns_rate = 1.047
ed_rate = 1.0946
socs_rate = 0.9169
ict_rate = 1.1471
serv_rate = 0.9112
agr_rate = 0.8679


df['salary'] = (df['salary'] * bus_rate).where(df['course'] == 'Bus', df['salary'] * 1)
df['salary'] = (df['salary'] * hw_rate).where(df['course'] == 'HW', df['salary'] * 1)
df['salary'] = (df['salary'] * eng_rate).where(df['course'] == 'Eng', df['salary'] * 1)
df['salary'] = (df['salary'] * arts_rate).where(df['course'] == 'Arts', df['salary'] * 1)
df['salary'] = (df['salary'] * ns_rate).where(df['course'] == 'Nats', df['salary'] * 1)
df['salary'] = (df['salary'] * ed_rate).where(df['course'] == 'Ed', df['salary'] * 1)
df['salary'] = (df['salary'] * socs_rate).where(df['course'] == 'Socs', df['salary'] * 1)
df['salary'] = (df['salary'] * ict_rate).where(df['course'] == 'ICT', df['salary'] * 1)
df['salary'] = (df['salary'] * serv_rate).where(df['course'] == 'Serv', df['salary'] * 1)
df['salary'] = (df['salary'] * agr_rate).where(df['course'] == 'Agr', df['salary'] * 1)


df

      location grade course        salary
0       Dublin    H1    ICT  35126.920969
1       Dublin   H21    ICT  43717.402656
2     Mid-East    H1    ICT  39860.184215
3       Dublin   H21    ICT  43641.979523
4     Mid-West   H21    ICT  34331.828777
..         ...   ...    ...           ...
95      Dublin   H22    ICT  31701.574069
96  South-West   H21    ICT  29425.717359
97        West   H21    ICT  33330.119719
98      Dublin    H1    ICT  44572.395499
99        West    H1    ICT  32757.519879

[100 rows x 4 columns]

In [112]:
rand_sal_ict = [random.randint(40000, 45000) for i in range(100)]

rand_sal_ict

# To just show the first 10 numbers in the list
#x[:10]

#df['salary'] = rand_sal

#df['salary'] = (df['salary'] * h1_rate).where(df['course'] == 'ICT', df['salary'] * 1)

[40398,
 44152,
 43171,
 43745,
 44228,
 42600,
 42431,
 40450,
 42363,
 41855,
 41326,
 42747,
 44590,
 40517,
 41295,
 44444,
 42861,
 41309,
 41045,
 41071,
 40960,
 41163,
 43514,
 42224,
 42685,
 41802,
 43089,
 40021,
 42637,
 44321,
 44720,
 41162,
 41025,
 40672,
 40147,
 41184,
 42302,
 41283,
 43278,
 43747,
 41960,
 44902,
 40232,
 44748,
 40931,
 44940,
 41556,
 41891,
 43414,
 41460,
 42561,
 43447,
 43745,
 41553,
 42160,
 43011,
 42197,
 40578,
 41971,
 44433,
 43644,
 40864,
 44259,
 43001,
 42809,
 42156,
 43257,
 41249,
 40917,
 44128,
 44139,
 43349,
 41317,
 42595,
 41162,
 41252,
 41203,
 44390,
 40005,
 40203,
 40957,
 42317,
 43634,
 42730,
 40943,
 43795,
 40187,
 43098,
 43943,
 43590,
 41415,
 44831,
 41506,
 43577,
 43689,
 42867,
 44017,
 41632,
 43058,
 40089]

In [113]:
# Just ICT - with a range of 39635 to 42562

#x = [random.randint(27951, 42562) for i in range(100)]

#x = df['course'] == 'ICT'
#random1 = df['course'] == 'ICT'
#df.loc[random1, 'salary'] = 100

#df

Check this link for code for the above
https://medium.com/@arsalan_zafar/updating-rows-and-columns-with-pandas-ab5dea97c1d3

Or this might work...
https://stackoverflow.com/questions/69770053/calculations-using-pandas

# Results

Give overview of results/how to read them etc...

use potentially histograms, pair plots, scatterplots, correllations etc...

# Summary

Add a summary of the notebook/wrap up

### References

$^1$ https://hea.ie/statistics/graduate-outcomes-data-and-reports/graduate-outcomes-2020/earnings-analysis/   
$^2$ https://www.independent.ie/irish-news/surge-in-graduate-employment-as-four-in-five-walk-into-a-job-with-average-salary-of-38044/42166132.html   
$^3$ https://hea.ie/assets/uploads/2021/09/Higher-Education-Institutions-Earnings-Report-September-2021.pdf   
$^4$ https://gradireland.com/careers-advice/job-offers-and-working-life/salaries-and-benefits-new-graduates   
$^5$ https://data.gov.ie/dataset/heo13-graduate-earnings

In [114]:
import numpy as np
import pandas as pd

# Create ict dataframe
df_ict = pd.DataFrame()
location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
df_ict['location'] = location_list
grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
df_ict['grade'] = grade_list
course_list = 'ICT'
df_ict['course'] = course_list
rand_sal_ict = [random.randint(40000, 45000) for i in range(100)]
df_ict['salary'] = rand_sal_ict

# Create eng dataframe
df_eng = pd.DataFrame()
location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
df_eng['location'] = location_list
grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
df_eng['grade'] = grade_list
course_list = 'Eng'
df_eng['course'] = course_list
rand_sal_eng = [random.randint(30000, 40000) for i in range(100)]
df_eng['salary'] = rand_sal_eng

final_df = pd.concat([df_ict, df_eng], ignore_index=True)

final_df = final_df.sample(frac = 1)

final_df

# Maybe use a for x in course list then if x = ict do the calcs etc then if x = Bus etc

       location grade course  salary
32     Mid-West   H22    ICT   41040
88     Mid-West    H1    ICT   40429
153  South-West   H21    Eng   30560
137      Dublin   H22    Eng   37512
146  South-West   H22    Eng   36608
..          ...   ...    ...     ...
175        West   H21    Eng   36215
143        West   H21    Eng   32295
67       Dublin   H21    ICT   44756
41       Border   H21    ICT   43989
194        West   H21    Eng   38598

[200 rows x 4 columns]

In [115]:
course_list = ['ICT', 'Bus', 'Eng', 'HW', 'Arts', 'Nats', 'Ed', 'Socs', 'Serv' ]

for course in course_list:

    if course == 'ICT':
        df_ict = pd.DataFrame()
        # location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_ict['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        # grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        df_ict['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_ict = [random.randint(40000, 45000) for i in range(100)]
        df_ict['salary'] = rand_sal_ict
        df_ict['course'] = 'ICT'

    elif course == 'Eng':
        df_eng = pd.DataFrame()
        # location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_eng['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        # grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        df_eng['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_eng = [random.randint(35000, 40000) for i in range(100)]
        df_eng['salary'] = rand_sal_eng
        df_eng['course'] = 'Eng'

    elif course == 'Ed':
        df_ed = pd.DataFrame()
        # location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_ed['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        # grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        df_ed['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_ed = [random.randint(31000, 32000) for i in range(100)]
        df_ed['salary'] = rand_sal_ed
        df_ed['course'] = 'Ed'

    else:
        df_agr = pd.DataFrame()
        # location_list = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_agr['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        # grade_list = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        df_agr['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_agr = [random.randint(20000, 25000) for i in range(100)]
        df_agr['salary'] = rand_sal_agr
        df_agr['course'] = 'Agr'

final_df = pd.concat([df_ict, df_eng, df_agr, df_ed], ignore_index=True)

final_df = final_df.sample(frac = 1)

final_df

# df_ict['course']

       location grade  salary course
307      Dublin   H22   31593     Ed
18   South-East   H21   42582    ICT
62   South-West    H3   43299    ICT
70   South-West   H22   44986    ICT
260      Dublin   H22   20069    Agr
..          ...   ...     ...    ...
123      Dublin   H21   37007    Eng
140    Mid-West   H21   35159    Eng
192        West   H22   35898    Eng
267  South-West    H3   21766    Agr
156      Dublin   H22   37362    Eng

[400 rows x 4 columns]

In [118]:
course_list = ['ICT', 'Bus', 'Eng', 'HW', 'Arts', 'Nats', 'Ed', 'Socs', 'Serv' ]
for course in course_list:

    if course == 'ICT':
        df_ict = pd.DataFrame()
        df_ict['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_ict['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_ict = [random.randint(40000, 45000) for i in range(100)]
        df_ict['salary'] = rand_sal_ict
        df_ict['course'] = course

    elif course == 'Eng':
        df_eng = pd.DataFrame()
        df_eng['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_eng['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_eng = [random.randint(35000, 40000) for i in range(100)]
        df_eng['salary'] = rand_sal_eng
        df_eng['course'] = course

    elif course == 'Ed':
        df_ed = pd.DataFrame()
        df_ed['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_ed['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_ed = [random.randint(31000, 32000) for i in range(100)]
        df_ed['salary'] = rand_sal_ed
        df_ed['course'] = course

    elif course == 'Agr':
        df_agr = pd.DataFrame()
        df_agr['location'] = np.random.choice(['Dublin', 'South-West', 'Mid-West','Mid-East', 'Midlands', 'South-East', 'West', 'Border'], 100, p=[0.40, 0.16, 0.10, 0.08, 0.04, 0.07, 0.10, 0.05])
        df_agr['grade'] = np.random.choice(['H1', 'H21', 'H22','H3'], 100, p=[0.17, 0.50, 0.27, 0.06])
        rand_sal_agr = [random.randint(30000, 35000) for i in range(100)]
        df_agr['salary'] = rand_sal_agr
        df_agr['course'] = 'Agr'

final_df = pd.concat([df_ict, df_eng, df_bus, df_ed, df_agr], ignore_index=True)

final_df = final_df.sample(frac = 1)

final_df

# df_ict['course']

       location grade  salary course
466  South-West   H21   34807    Agr
246        West    H1   29686    Bus
14       Border    H1   41152    ICT
179      Dublin   H21   36399    Eng
353  South-East   H22   31247     Ed
..          ...   ...     ...    ...
98       Dublin   H22   41029    ICT
392      Dublin   H21   31847     Ed
70       Dublin   H21   44111    ICT
484  South-West   H22   34009    Agr
96     Mid-West   H22   41756    ICT

[500 rows x 4 columns]